import pyttsx3
engine = pyttsx3.init()
engine.say('''یہ ایک بات سمجھنے میں رات ہو گئی ہے
میں اس سے جیت گیا ہوں کہ مات ہو گئی ہے

میں اب کے سال پرندوں کا دن مناؤں گا
مری قریب کے جنگل سے بات ہو گئی ہے

بچھڑ کے تجھ سے نہ خوش رہ سکوں گا سوچا تھا
تری جدائی ہی وجہ نشاط ہو گئی ہے

بدن میں ایک طرف دن طلوع میں نے کیا
بدن کے دوسرے حصے میں رات ہو گئی ہے

میں جنگلوں کی طرف چل پڑا ہوں چھوڑ کے گھر
یہ کیا کہ گھر کی اداسی بھی ساتھ ہو گئی ہے

رہے گا یاد مدینے سے واپسی کا سفر
میں نظم لکھنے لگا تھا کہ نعت ہو گئی ہے''')
engine.runAndWait()